init.org
#+TITLE: Emacs configuration
#+AUTHOR: Janne Sauvala
#+PROPERTY: header-args:emacs-lisp :results silent :tangle init.el

* Table of contents
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#add-lexical-binding-to-generated-file][Add lexical binding to generated file]]
- [[#native-compilation][Native compilation]]
- [[#auto-update-packages][Auto update packages]]
- [[#keep-emacsd-clean][Keep .emacs.d clean]]
- [[#server-mode][Server mode]]
- [[#setup-path-from-shell][Setup path from shell]]
- [[#keyboard-bindings][Keyboard bindings]]
  - [[#mac-keyboard--finnish-layout][Mac keyboard + Finnish layout]]
  - [[#esc-cancels-all][ESC cancels all]]
  - [[#evil][Evil]]
  - [[#which-key][which-key]]
  - [[#leader-bindings-with-generalel][Leader bindings with general.el]]
  - [[#enable-keychord-bind-with-use-package][Enable keychord bind with use-package]]
  - [[#custom-keybindings-with-generalel][Custom keybindings with General.el]]
- [[#general-configuration][General configuration]]
  - [[#improve-scrolling][Improve scrolling]]
  - [[#line-numbers][Line numbers]]
  - [[#theme][Theme]]
  - [[#emojis-in-buffers][Emojis in buffers]]
  - [[#modeline][Modeline]]
    - [[#doom-modeline][Doom-modeline]]
    - [[#minions][Minions]]
    - [[#mode-diminishing][Mode diminishing]]
  - [[#recent-files][Recent files]]
  - [[#restarting-and-quitting-emacs][Restarting and quitting Emacs]]
  - [[#default-encoding][Default encoding]]
  - [[#enable-font-ligatures][Enable font ligatures]]
- [[#completion][Completion]]
  - [[#improve-completions][Improve completions]]
    - [[#orderless][Orderless]]
    - [[#consult][Consult]]
    - [[#embark][Embark]]
  - [[#vertico][Vertico]]
  - [[#completion-metadata][Completion metadata]]
    - [[#add-icons-to-marginalia-metadata][Add icons to Marginalia metadata]]
      - [[#all-the-icons][all-the-icons]]
      - [[#all-the-icons-completion][all-the-icons-completion]]
    - [[#marginalia][Marginalia]]
  - [[#auto-complete][Auto complete]]
    - [[#corfu][Corfu]]
    - [[#emacs-configs-for-corfu][Emacs configs for Corfu]]
    - [[#dabbrev][Dabbrev]]
  - [[#save-minibuffer-history][Save minibuffer history]]
- [[#development][Development]]
  - [[#magit][Magit]]
  - [[#projectile][Projectile]]
  - [[#treemacs][Treemacs]]
  - [[#terminal][Terminal]]
  - [[#languages][Languages]]
    - [[#clojure][Clojure]]
    - [[#javascript][Javascript]]
    - [[#go][Go]]
    - [[#java][Java]]
    - [[#lsp][LSP]]
      - [[#python][Python]]
      - [[#dap-mode][dap-mode]]
      - [[#lsp-treemacs][lsp-treemacs]]
    - [[#docker][Docker]]
    - [[#terraform][Terraform]]
  - [[#arduino-with-platformio][Arduino with PlatformIO]]
  - [[#aggressive-indent-mode][Aggressive indent mode]]
- [[#productivity][Productivity]]
  - [[#rainbow-delimiter][Rainbow delimiter]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#flycheck][Flycheck]]
  - [[#avy][Avy]]
  - [[#ace-window][Ace-window]]
  - [[#expand-region][Expand region]]
  - [[#commenting-lines][Commenting lines]]
  - [[#winner-mode][Winner mode]]
  - [[#super-save][Super save]]
  - [[#highlight-uncommitted-changes][Highlight uncommitted changes]]
  - [[#alerts][Alerts]]
  - [[#buflerel][Bufler.el]]
- [[#org-mode][Org mode]]
  - [[#org-config][Org config]]
  - [[#pomodoro][Pomodoro]]
  - [[#add-toc-automatically][Add TOC automatically]]
  - [[#visual-fill][Visual fill]]
  - [[#fonts-and-bullets][Fonts and bullets]]
  - [[#org-roam][Org-roam]]
- [[#other-tools][Other tools]]
  - [[#speed-typing][Speed typing]]
  - [[#elisp-bug-hunter][Elisp bug hunter]]
:END:

* Add lexical binding to generated file
#+begin_src emacs-lisp
  ;;; init.el -*- lexical-binding: t ; eval: (view-mode -1) -*-
#+end_src

* Native compilation
#+begin_src emacs-lisp
  (setq comp-async-report-warnings-errors nil)
#+end_src

* Auto update packages
#+begin_src emacs-lisp
  (use-package auto-package-update
    :config
    (setq auto-package-update-delete-old-versions t
          auto-package-update-hide-results t
          auto-package-update-prompt-before-update t)
    (auto-package-update-maybe))
#+end_src

* Keep .emacs.d clean
#+begin_src emacs-lisp
  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))
  
  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering)
  
  ;; Keep customization settings in a temporary file (thanks Ambrevar!)
  ;(setq custom-file
  ;    (if (boundp 'server-socket-dir)
  ;        (expand-file-name "custom.el" server-socket-dir)
  ;    (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  ;(load custom-file t)
#+end_src

* Server mode
#+begin_src emacs-lisp
  (server-start)
#+end_src

* Setup path from shell
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
#+end_src

* Keyboard bindings
** Mac keyboard + Finnish layout 
#+begin_src emacs-lisp
  (setq mac-right-option-modifier 'nil
        mac-option-modifier 'super
        mac-command-modifier 'meta
        ns-function-modifier 'hyper
        x-select-enable-clipboard t)
#+end_src

** ESC cancels all
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Evil
#+begin_src emacs-lisp
  (defun js/evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))
  
  (defun js/dont-arrow-me-bro ()
    (interactive)
    (message "Arrow keys are bad, you know?"))
  
  (use-package undo-tree
    :init
    (global-undo-tree-mode 1))
  
  (use-package evil
    :defer 0.1
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)
    (setq evil-undo-system 'undo-tree)
    :config
    (add-hook 'evil-mode-hook 'js/evil-hook)
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  
  (use-package evil-collection
    :after evil
    :init
    (evil-collection-init) 
    :custom
    (dolist (mode '(anaconda-mode
                    buff-menu
                    calc
                    comint
                    company
                    custom
                    eldoc
                    elisp-mode
                    ert
                    free-keys
                    helm
                    indent
                    image
                    kotlin-mode
                    occur
                    outline
                    package-menu
                    simple
                    slime
                    lispy))
      (setq evil-collection-mode-list (delq mode evil-collection-mode-list)))
    ;(evil-collection-outline-bind-tab-p nil)
    ;:config
    ;(setq evil-collection-mode-list
    ;      (remove 'lispy evil-collection-mode-list))
    ;(evil-collection-init)
    )
#+end_src

** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

** Leader bindings with general.el
#+begin_src emacs-lisp
  (use-package general
    :defer 0.1
    :config
    (general-evil-setup t)
  
    (general-create-definer js/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "s-SPC"))
#+end_src

** Enable keychord bind with use-package
#+begin_src emacs-lisp
  (use-package use-package-chords
    :disabled
    :config (key-chord-mode 1))
#+end_src

** Custom keybindings with General.el
#+begin_src emacs-lisp
  (js/leader-key-def
        "f"   '(:ignore t :which-key "files")
        "ff"  '(find-file :which-key "open file")
        "fs"  'save-buffer
        "fr"  '(consult-recent-file :which-key "recent files")
        "fR"  '(revert-buffer :which-key "revert file"))
#+end_src

* General configuration
** Improve scrolling
#+begin_src emacs-lisp
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
  (setq scroll-step 1) ;; keyboard scroll one line at a time
  (setq use-dialog-box nil)
#+end_src

** Line numbers
#+begin_src emacs-lisp
  (column-number-mode)
  
  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
  
  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  #+end_src
  
** Theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :hook (emacs-startup . (lambda () (load-theme 'doom-one t)))
    :config
    (doom-themes-visual-bell-config))
#+end_src

** Emojis in buffers
#+begin_src emacs-lisp
  (use-package emojify
    :hook (erc-mode . emojify-mode)
    :commands emojify-mode)
#+end_src

** Modeline
