init.el
;;; init.el -*- lexical-binding: t ; eval: (view-mode -1) -*-

(setq comp-async-report-warnings-errors nil)

(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t
        auto-package-update-hide-results t
        auto-package-update-prompt-before-update t)
  (auto-package-update-maybe))

;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
    url-history-file (expand-file-name "url/history" user-emacs-directory))

;; Use no-littering to automatically set common paths to the new user-emacs-directory
(use-package no-littering)

;; Keep customization settings in a temporary file (thanks Ambrevar!)
;(setq custom-file
;    (if (boundp 'server-socket-dir)
;        (expand-file-name "custom.el" server-socket-dir)
;    (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
;(load custom-file t)

(server-start)

(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

(setq mac-right-option-modifier 'nil
      mac-option-modifier 'super
      mac-command-modifier 'meta
      ns-function-modifier 'hyper
      x-select-enable-clipboard t)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(defun js/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  erc-mode
                  circe-server-mode
                  circe-chat-mode
                  circe-query-mode
                  sauron-mode
                  term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))

(defun js/dont-arrow-me-bro ()
  (interactive)
  (message "Arrow keys are bad, you know?"))

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :defer 0.1
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  (setq evil-undo-system 'undo-tree)
  :config
  (add-hook 'evil-mode-hook 'js/evil-hook)
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :init
  (evil-collection-init) 
  :custom
  (dolist (mode '(anaconda-mode
                  buff-menu
                  calc
                  comint
                  company
                  custom
                  eldoc
                  elisp-mode
                  ert
                  free-keys
                  helm
                  indent
                  image
                  kotlin-mode
                  occur
                  outline
                  package-menu
                  simple
                  slime
                  lispy))
    (setq evil-collection-mode-list (delq mode evil-collection-mode-list)))
  ;(evil-collection-outline-bind-tab-p nil)
  ;:config
  ;(setq evil-collection-mode-list
  ;      (remove 'lispy evil-collection-mode-list))
  ;(evil-collection-init)
  )

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package general
  :defer 0.1
  :config
  (general-evil-setup t)

  (general-create-definer js/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "s-SPC"))

(use-package use-package-chords
  :disabled
  :config (key-chord-mode 1))

(js/leader-key-def
      "f"   '(:ignore t :which-key "files")
      "ff"  '(find-file :which-key "open file")
      "fs"  'save-buffer
      "fr"  '(consult-recent-file :which-key "recent files")
      "fR"  '(revert-buffer :which-key "revert file"))

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
(setq use-dialog-box nil)

(column-number-mode)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

;; Override some modes which derive from the above
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package doom-themes
  :hook (emacs-startup . (lambda () (load-theme 'doom-one t)))
  :config
  (doom-themes-visual-bell-config))

(use-package emojify
  :hook (erc-mode . emojify-mode)
  :commands emojify-mode)
