init.org
*** Doom-modeline
Run =all-the-icons-install-fonts= after installing this package
#+begin_src emacs-lisp
  (use-package doom-modeline
    :init
    (unless after-init-time
      ;; prevent flash of unstyled modeline at startup
      (setq-default mode-line-format nil))
    :custom-face
    (mode-line ((t (:family "JetBrains Mono" :height 125))))
    (mode-line-inactive ((t (:family "JetBrains Mono" :height 125))))
    :custom
    (doom-modeline-height 25)
    (doom-modeline-bar-width 4)
    (doom-modeline-lsp t)
    (doom-modeline-github nil)
    (doom-modeline-mu4e nil)
    (doom-modeline-irc nil)
    (doom-modeline-minor-modes t)
    (doom-modeline-persp-name nil)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-major-mode-icon nil)
    :hook (emacs-startup . (lambda () (doom-modeline-mode 1))))
#+end_src

Change modeline font size to match modeline's height
[[https://github.com/seagle0128/doom-modeline/issues/187#issuecomment-806448361]]
#+begin_src emacs-lisp
  ;; (defun js/doom-modeline--font-height ()
  ;;   "Calculate the actual char height of the mode-line."
  ;;   (+ (frame-char-height) 2))
  
  ;; (advice-add #'doom-modeline--font-height :override #'js/doom-modeline--font-height)
#+end_src
*** Minions
#+begin_src emacs-lisp  
  (use-package minions
    :after doom-modeline
    :hook (doom-modeline-mode . minions-mode))
#+end_src

*** Mode diminishing
#+begin_src emacs-lisp
  (use-package diminish)
#+end_src

** Recent files
#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook (lambda ()
                                  (recentf-mode 1)
                                  (setq recentf-max-menu-items 25)
                                  (setq recentf-max-saved-items 25)))
#+end_src

** Restarting and quitting Emacs
#+begin_src emacs-lisp
  (defun js/reload-init ()
    "Reload init.el."
    (interactive)
    (message "Reloading init.el...")
    (load user-init-file nil 'nomessage)
    (message "Reloading init.el... done."))

  (use-package restart-emacs
    :general
    (js/leader-key-def
      "q"   '(:ignore t :which-key "quit")
      "qq"  '(save-buffers-kill-emacs :which-key "quit emacs")
      "qR"  'restart-emacs
      "qr"  '(js/reload-init :which-key "reload confs")))
#+end_src

** Default encoding
https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs
#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  ;; backwards compatibility as default-buffer-file-coding-system
  ;; is deprecated in 23.2.
  (if (boundp 'buffer-file-coding-system)
      (setq-default buffer-file-coding-system 'utf-8)
    (setq default-buffer-file-coding-system 'utf-8))
  
  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+end_src

** Enable font ligatures
#+begin_src emacs-lisp
  (mac-auto-operator-composition-mode t)
#+end_src

* Completion
Many of the settings here are taken from daviwil.
https://github.com/daviwil/dotfiles/blob/master/Emacs.org#completion-system

** Improve completions
*** Orderless
"This package provides an orderless completion style that divides the pattern into space-separated components, and matches candidates that match all of the components in any order."
https://github.com/oantolin/orderless
#+begin_src emacs-lisp
  (use-package orderless
    :defer 0.1
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

*** Consult
"Consult provides various practical commands based on the Emacs completion function completing-read, which allows to quickly select an item from a list of candidates with completion."
https://github.com/minad/consult
#+begin_src emacs-lisp
  (defun js/get-project-root ()
    (when (fboundp 'projectile-project-root)
      (projectile-project-root)))

  (use-package consult
    :bind (("C-s" . consult-line)
	   ("C-M-l" . consult-imenu)
	   ("M-p" . consult-yank-from-kill-ring)
	   :map minibuffer-local-map
	   ("C-r" . consult-history))
    :custom
    (consult-project-root-function #'js/get-project-root)
    (completion-in-region-function #'consult-completion-in-region))
#+end_src

*** Embark
"This package provides a sort of right-click contextual menu for Emacs, accessed through the embark-act command (which you should bind to a convenient key), offering you relevant actions to use on a target determined by the context."
https://github.com/oantolin/embark
#+begin_src emacs-lisp 
  (use-package embark
    :bind (("C-S-a" . embark-act)
	   ("C-S-w" . embark-dwim)
	   :map minibuffer-local-map
	   ("C-d" . embark-act))
    :config
    ;; Show Embark actions via which-key
    (setq embark-action-indicator
	  (lambda (map _target)
	    (which-key--show-keymap "Embark" map nil nil 'no-paging)
	    #'which-key--hide-popup-ignore-command)
	  embark-become-indicator embark-action-indicator))

  (use-package embark-consult
    :after (embark consult)
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Vertico
#+begin_src emacs-lisp
  (defun js/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
  folder, otherwise delete a word"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
        (backward-kill-word arg)))
  
  (use-package vertico
    :after orderless
    :bind (:map vertico-map
           ("C-j" . vertico-next)
           ("C-k" . vertico-previous)
           ("C-f" . vertico-exit)
           :map minibuffer-local-map
           ("M-h" . js/minibuffer-backward-kill))
    :custom
    (vertico-cycle t)
    :custom-face
    (vertico-current ((t (:background "#3a3f5a"))))
    :init
    (vertico-mode))
#+end_src

** Completion metadata
*** Add icons to Marginalia metadata
Add icons to files names
[[https://github.com/minad/marginalia/issues/59]]
**** all-the-icons
#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

**** all-the-icons-completion
#+begin_src emacs-lisp
  (use-package all-the-icons-completion
    :straight (:host github :repo "iyefrat/all-the-icons-completion")
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup))
#+end_src

*** Marginalia
#+begin_src emacs-lisp 
  (use-package marginalia
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :hook (emacs-startup . marginalia-mode))
#+end_src

** Auto complete
*** Corfu
#+begin_src emacs-lisp
  (use-package corfu
    :after orderless
    :bind
    (:map corfu-map
          ("TAB" . corfu-next)
          ("S-TAB" . corfu-previous))
    :custom
    (corfu-cycle t)
    (corfu-quit-at-boundary t)
    (corfu-quit-no-match t)
    :init
    (corfu-global-mode))
#+end_src

*** Emacs configs for Corfu
#+begin_src emacs-lisp
  (use-package emacs
    :init
    (setq read-extended-command-predicate 'command-completion-default-include-p)
    ;(setq tab-always-indent 'complete)
    )
#+end_src

*** Dabbrev
#+begin_src emacs-lisp
  (use-package dabbrev
    :bind
    (("C-SPC" . dabbrev-completion))) 
#+end_src

** Save minibuffer history
 #+begin_src emacs-lisp 
   (use-package savehist
     :defer 0.1 
     :config
     (savehist-mode))
   
     ;; Individual history elements can be configured separately
     ;;(put 'minibuffer-history 'history-length 25)
     ;;(put 'evil-ex-history 'history-length 50)
     ;;(put 'kill-ring 'history-length 25))
 #+end_src

* Development
** Magit
#+begin_src emacs-lisp
  (use-package magit
    :bind ("C-M-;" . magit-status)
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
  
  (js/leader-key-def
    "g"   '(:ignore t :which-key "git")
    "gs"  'magit-status
    "gd"  'magit-diff-unstaged
    "gc"  'magit-branch-or-checkout
    "gl"   '(:ignore t :which-key "log")
    "glc" 'magit-log-current
    "glf" 'magit-log-buffer-file
    "gb"  'magit-branch
    "gP"  'magit-push-current
    "gp"  'magit-pull-branch
    "gf"  'magit-fetch
    "gF"  'magit-fetch-all
    "gr"  'magit-rebase)
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :bind ("C-M-p" . projectile-find-file)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :config
    (projectile-mode)
    :custom
    (projectile-auto-discover nil)
    (projectile-ignored-projects '("~/")))
  
  (use-package consult-projectile
    :straight (consult-projectile :type git :host gitlab :repo "OlMon/consult-projectile" :branch "master"))
  
  (js/leader-key-def
    "p"   '(:ignore t :which-key "project")
    "pf"  'projectile-find-file
    "ps"  'projectile-switch-project
    "pF"  'consult-ripgrep
    "pp"  'projectile-find-file
    "pc"  'projectile-compile-project
    "pd"  'projectile-dired)
#+end_src

