init.el

(use-package treemacs
  :defer 1.5
  :config
  (js/leader-key-def
    "t"   '(:ignore t :which-key "treemacs")
    "tt"  'treemacs)
  (setq treemacs-follow-mode t))

(use-package treemacs-evil
  :after treemacs)

(use-package treemacs-projectile
  :after treemacs)

(use-package vterm)

(use-package cider)

(use-package nvm)

(use-package typescript-mode
  :mode "\\.ts\\'"
  :config
  (setq typescript-indent-level 2))

(defun js/set-js-indentation ()
  (setq js-indent-level 2)
  (setq evil-shift-width js-indent-level)
  (setq-default tab-width 2))

(use-package js2-mode
  :mode
  (("\\.js\\'" . js2-mode))
  :custom
  (js2-include-node-externs t)
  (js2-global-externs '("customElements"))
  (js2-highlight-level 3)
  (js2r-prefer-let-over-var t)
  (js2r-prefered-quote-type 2)
  (js-indent-align-list-continuation t)
  (global-auto-highlight-symbol-mode t) 
  :config
  ;; Use js2-mode for Node scripts
  (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))
  ;; Don't use built-in syntax checking
  ; (setq js2-mode-show-strict-warnings nil)

  ;; Set up proper indentation in JavaScript and JSON files
  (add-hook 'js2-mode-hook #'js/set-js-indentation)
  (add-hook 'json-mode-hook #'js/set-js-indentation))

(use-package apheleia
  :config
  (apheleia-global-mode +1))

(use-package prettier-js
  :hook ((js2-mode . prettier-js-mode)
          (typescript-mode . prettier-js-mode)))

(use-package go-mode)

(use-package lsp-java)

(use-package lsp-mode
  :commands lsp
  :hook
  (((clojure-mode clojurescript-mode clojurec-mode python-mode go-mode terraform-mode java-mode) . lsp)
   (go-mode . js/lsp-go-install-save-hooks))
  :bind
  (:map lsp-mode-map ("TAB" . completion-at-point))
  :custom
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-modeline-code-actions-enable nil)
  (lsp-lens-enable t)
  (lsp-idle-delay 0.500)
  :config
  (setq read-process-output-max 1048576) ; (* 1024 1024)

  ;; Install TF LSP: https://github.com/hashicorp/terraform-ls
  ;; Editor integration: https://github.com/hashicorp/terraform-ls/blob/main/docs/USAGE.md#emacs
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("/usr/local/bin/terraform-ls" "serve"))
                    :major-modes '(terraform-mode)
                    :server-id 'terraform-ls))
  ;; gopls
  (defun js/lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (lsp-register-custom-settings
   '(("gopls.completeUnimported" t t)
     ("gopls.staticcheck" t t)))) 

(js/leader-key-def
  "l"  '(:ignore t :which-key "lsp")
  "ld" 'xref-find-definitions
  "lr" 'xref-find-references
  "ln" 'lsp-ui-find-next-reference
  "lp" 'lsp-ui-find-prev-reference
  "ls" 'counsel-imenu
  "le" 'lsp-ui-flycheck-list
  "lS" 'lsp-ui-sideline-mode
  "lX" 'lsp-execute-code-action)

(use-package lsp-ui
  :after lsp-mode
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-position 'bottom))

(use-package lsp-pyright
  :after lsp-mode
  :hook (python-mode . (lambda ()
                      (require 'lsp-pyright)
                      (lsp-deferred))))

(use-package dap-mode
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  ;; :config
  ;; (dap-ui-mode 1)
  :commands dap-debug
  :config
  ;; Set up Node debugging
  (require 'dap-node)
  (dap-node-setup) ;; Automatically installs Node debug adapter if needed
  (require 'dap-go)
  ;; Bind `C-c l d` to `dap-hydra` for easy access
  (general-define-key
    :keymaps 'lsp-mode-map
    :prefix lsp-keymap-prefix
    "d" '(dap-hydra t :wk "debugger")))

(use-package lsp-treemacs
  :after (lsp treemacs)
  :init
  (lsp-treemacs-sync-mode 1))

(use-package docker
  :ensure t
  :general
  (js/leader-key-def
    "d" 'docker))

(use-package terraform-mode)

(use-package platformio-mode
  :hook
  (c++-mode-hook . (lambda ()
                     (lsp-deferred)
                     (platformio-conditionally-enable))))

(use-package aggressive-indent-mode
  :hook (emacs-lisp-mode-hook clojure-mode org))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :hook (org-mode
         emacs-lisp-mode
         web-mode
         typescript-mode
         js2-mode))

(use-package flycheck
  :hook (lsp-mode . flycheck-mode))

(use-package avy
  :bind
  (("M-g c" . 'avy-goto-char)
   ("M-g 2" . 'avy-goto-char-2)
   ("M-g t" . 'avy-goto-char-timer)
   ("M-g h" . 'avy-org-goto-heading-timer)
   ("M-g l" . 'avy-goto-line))
  :general
  (js/leader-key-def
    "j"   '(:ignore t :which-key "jump")
    "jt"  '(avy-goto-char-timer :which-key "time"))
  :config
  (avy-setup-default))

(use-package ace-window
  :bind
  (("M-o" . ace-window))
  :custom
  (aw-scope 'frame)
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (aw-minibuffer-flag t)
  ;(aw-background t)
  :config
  (ace-window-display-mode 1))

(use-package expand-region
   :bind (("M-[" . er/expand-region)
          ("C-(" . er/mark-outside-pairs)))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package winner
  :after evil
  :config
  (winner-mode)
  (define-key evil-window-map "u" 'winner-undo)
  (define-key evil-window-map "U" 'winner-redo))

(use-package super-save
  :defer 1
  :diminish super-save-mode
  :config
  (super-save-mode +1)
  :custom
  (super-save-auto-save-when-idle t))

(use-package diff-hl
  :config
  (global-diff-hl-mode)
  :hook
  (magit-pre-refresh-hook . diff-hl-magit-pre-refresh)
  (magit-post-refresh-hook . diff-hl-magit-post-refresh))

(use-package alert
  :commands alert
  :config
  (setq alert-default-style 'notifications))

(use-package bufler)
