init.el

;; Increase the size of various headings
;(set-face-attribute 'org-document-title nil :font "JetBrains Mono" :weight 'bold :height 1.3)
;(dolist (face '((org-level-1 . 1.2)
;                (org-level-2 . 1.1)
;(org-level-3 . 1.05)
;                (org-level-4 . 1.0)
;                (org-level-5 . 1.1)
;                (org-level-6 . 1.1)
;                (org-level-7 . 1.1)
;                (org-level-8 . 1.1)))
;(set-face-attribute (car face) nil :font "JetBrains Mono" :weight 'medium :height (cdr face)))

;; Make sure org-indent face is available
;(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
;(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
;(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
;(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
;(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
;(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
;(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
;(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
;(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
;(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;; Get rid of the background on column views
;;(set-face-attribute 'org-column nil :background nil)
;;(set-face-attribute 'org-column-title nil :background nil)

(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/Google Drive/org/org-roam/"))
  :general
  (js/leader-key-def
    "or"    '(:ignore t :which-key "org-roam")
    "orb"   '(org-roam-buffer-toggle :which-key "toggle-buffer")
    "orf"   '(org-roam-node-find :which-key "find-node")
    "org"   '(org-roam-graph :which-key "graph")
    "ori"   '(org-roam-node-insert :which-key "insert-node")
    "orc"   '(org-roam-capture :which-key "capture")
    "ort"  '(org-roam-dailies-capture-today :which-key "capture-today"))
  :config
  (org-roam-setup))

(use-package speed-type)

(use-package bug-hunter)
